src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Сотрудник является клиентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>APIВес</Name>
					<Comment>Вес сотрудника для API, сначала выводятся более тяжелые</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОМС</Name>
					<Comment>Код по ОМС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДляСайтаHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольОнЛайнКалендаря</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДляОнлайнЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РольПользователя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПользовательИБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СпецилазацииСотрудника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специализация</Name>
							<Comment>Специализация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Comment>Основная специализация</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеКассы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСтруктурныеЕдиницыЖурналаЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтруктурнаяЕдиница</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/УслугиСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УслугиСотрудника</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НормаВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтатусыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойШаблонОбследований</Name>
					<Comment>Основной шаблон обследований</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОбследований</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПриемНесколькихПациентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментыНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяРучнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/Сотрудники/Forms/ФормаУслугиСотрудника/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Сотрудник", Сотрудник); 	
	
	ЭтотОбъект.ПодборОтобразитьДеревом = Истина;
	ЭтотОбъект.ПодборРазвернутьДерево  = Истина;
	ЭтотОбъект.ДоступноИзменениеУслугСотрудника = РольДоступна("ДобавлениеИзменениеНоменклатуры") ИЛИ РольДоступна("ДобавлениеИзменениеСотрудников") 
														ИЛИ РольДоступна("ПолныеПрава") ИЛИ РольДоступна("АдминистраторСистемы");
	
	СоздатьДеревоУслуг();
	УстановитьУсловноеОформление();  

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	УстановитьФильтр();
	ПослеЗаполненияСпискаподбораноменклатур(); 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы   

&НаКлиенте
// Процедура, обработчик команды "СкопироватьНастройки".
//
Процедура СкопироватьНастройки(Команда)
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора",,,,,,Новый ОписаниеОповещения("СкопироватьНастройкиЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик завершения команды.
//
Процедура СкопироватьНастройкиЗавершение(Источник, Параметры) Экспорт
	
	Если Не Источник = Неопределено и Не Источник = Сотрудник Тогда
		СкопироватьНастройкиСотрудника(Источник);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ПодборПереключательФильтраПриИзменении(Элемент)
	
	ПерезаполнитьДеревоПодбораНоменклатур();
	
КонецПроцедуры
	
&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ПодборФильтрПриИзменении(Элемент)
	
	ПерезаполнитьДеревоПодбораНоменклатур();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ПодборФильтрАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЭтотОбъект.ПодборФильтр = Текст;
	
	#Если не ВебКлиент Тогда
		Системнаяинформация = Новый Системнаяинформация;
		Если Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86 Или Системнаяинформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда 
			WSHShell = Новый COMОбъект("WScript.Shell");
			WSHShell.SendKeys("{Right}");
		КонецЕсли;
	#Конецесли

ПерезаполнитьДеревоПодбораНоменклатур();

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура ФильтрПриИзменении(Элемент)

УстановитьФильтр();
Если Фильтр = 1 Тогда
	
	ИдТекЭлемент = ПолучитьИдентификаторПервойНоменклатурыВспискеПодбора(ЭтаФорма._ПодборНоменклатур, Истина);
	Если ИдТекЭлемент <> Неопределено Тогда
		Элементы._ПодборНоменклатур.ТекущаяСтрока = ИдТекЭлемент;
	КонецЕсли;
	
КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура Подключаемый_ПодборНоменклатураПриИзменении(Элемент)
	
	ИмяКолонки 	  = Элемент.Имя;
	ТекущиеДанные = Элементы._ПодборНоменклатур.ТекущиеДанные;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда  
		
		Если ТекущиеДанные[ИмяКолонки] = 2 Тогда
			ТекущиеДанные[ИмяКолонки] = 0;
		КонецЕсли;
		
		УстановитьФлагиНаЭлементы(ТекущиеДанные, ИмяКолонки);
		УстановитьФлагиНаГруппы(ТекущиеДанные, ИмяКолонки, Истина);
		
	Иначе
		
		Если ТекущиеДанные[ИмяКолонки] = 2 Тогда
			ТекущиеДанные[ИмяКолонки] = 0;
		КонецЕсли;
		
		УстановитьФлагиНаГруппы(ТекущиеДанные, ИмяКолонки);
		
	КонецЕсли;
	
	Если Фильтр = 1 Тогда
		
		ИдТекЭлемент = ПолучитьИдентификаторПервойНоменклатурыВспискеПодбора(ЭтаФорма._ПодборНоменклатур, Истина);		
		Если ИдТекЭлемент <> Неопределено Тогда
			Элементы._ПодборНоменклатур.ТекущаяСтрока = ИдТекЭлемент;
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаНоменклатуры.Очистить();
	ДанныеДерева = ЭтаФорма._ПодборНоменклатур.ПолучитьЭлементы();
	Для Каждого СтрокаТЧ из ДанныеДерева Цикл
		
		Если СтрокаТЧ.ЭтоГруппа Тогда
			ЗаполнитьТаблицуНоменклатуры(СтрокаТЧ);
		Иначе
			ЗаполнитьСтрокуТаблицыНоменклатуры(СтрокаТЧ);
		КонецЕсли;
		
	КонецЦикла;
	
	СохранитьЗначения(ТаблицаНоменклатуры, Сотрудник);
	
КонецПроцедуры  

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура Подключаемый_НормаВремениПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы._ПодборНоменклатур.ТекущиеДанные;
	ТекущиеДанные.НормаВремениСотрудника = НЕ ТекущиеДанные.НормаВремени = ТекущиеДанные.БазоваяНормаВремени;
	
	ТаблицаНоменклатуры.Очистить();
	ДанныеДерева = ЭтаФорма._ПодборНоменклатур.ПолучитьЭлементы();
	Для Каждого СтрокаТЧ из ДанныеДерева Цикл
		Если СтрокаТЧ.ЭтоГруппа Тогда
			ЗаполнитьТаблицуНоменклатуры(СтрокаТЧ);
		Иначе
			ЗаполнитьСтрокуТаблицыНоменклатуры(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;
	
	СохранитьЗначения(ТаблицаНоменклатуры, Сотрудник);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередНачаломДобавления".
//
Процедура Подключаемый_ПодборСотрудниковПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПередУдалением".
//
Процедура Подключаемый_ПодборСотрудниковПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура, устанвливает фильтр.
//
Процедура УстановитьФильтр()
	
	ЭлементУФ = ЭтаФорма.УсловноеОформление.Элементы[0];
	Если Фильтр = 1 Тогда
		ЭтаФорма.УсловноеОформление.Элементы[0].Использование = Истина;
	Иначе
		ЭтаФорма.УсловноеОформление.Элементы[0].Использование = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, выполняет заполнение подбора номенклатуры 
//
Процедура ЗаполнитьДеревоПодбораНоменклатур()
	
	ЗапросГрупп = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СправочникНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|ГДЕ
	|	СправочникНоменклатура.ЭтоГруппа = ИСТИНА
	|	И СправочникНоменклатура.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ");	
	
	ВыборкаГрупп = ЗапросГрупп.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);	
	ЭтаФорма._ПодборНоменклатурИсточникГрупп.ПолучитьЭлементы().Очистить();	
	
	ЗаполнитьИсточникГрупп(ВыборкаГрупп, ЭтаФорма._ПодборНоменклатурИсточникГрупп.ПолучитьЭлементы());	
	ПустаяГруппа = ЭтаФорма._ПодборНоменклатурИсточникГрупп.ПолучитьЭлементы().Добавить();
	
	ЗапросНоменклатур = Новый Запрос(
	"ВЫБРАТЬ
	|	УслугиСотрудника.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УслугиСотрудника.Номенклатура КАК Номенклатура,
	|	УслугиСотрудника.НормаВремени КАК НормаВремени
	|ПОМЕСТИТЬ УслугиСотрудника
	|ИЗ
	|	РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
	|ГДЕ
	|	УслугиСотрудника.Сотрудник = &Сотрудник
	|	И УслугиСотрудника.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпрНоменклатура.Ссылка КАК Номенклатура,
	|	СпрНоменклатура.ЭтоГруппа КАК ЭтоГруппа,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ЭтоГруппа
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндКартинки,
	|	СпрНоменклатура.Родитель КАК Родитель,
	|	СпрНоменклатура.Артикул КАК Артикул,
	|	СпрНоменклатура.Наименование КАК Наименование,
	|	СпрНоменклатура.НормаВремени КАК НормаВремени,
	|	СпрНоменклатура.НормаВремени КАК БазоваяНормаВремени,
	|	ВЫБОР
	|		КОГДА СпрНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоУслуга,
	|	УслугиСотрудника.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УслугиСотрудника.НормаВремени КАК НормаВремениСотрудника
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ УслугиСотрудника КАК УслугиСотрудника
	|		ПО СпрНоменклатура.Ссылка = УслугиСотрудника.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыНоменклатуры.СрезПоследних КАК СтатусНоменклатуры
	|		ПО (СтатусНоменклатуры.Номенклатура = СпрНоменклатура.Ссылка)
	|ГДЕ
	|	НЕ СпрНоменклатура.ПометкаУдаления
	|	И СпрНоменклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга))
	|	И НЕ СпрНоменклатура.ЭтоГруппа
	|	И ЕСТЬNULL(СтатусНоменклатуры.ВПродаже, ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|ИТОГИ
	|	МАКСИМУМ(ЭтоГруппа),
	|	МАКСИМУМ(ИндКартинки),
	|	МАКСИМУМ(Родитель),
	|	МАКСИМУМ(Артикул),
	|	МАКСИМУМ(Наименование),
	|	МАКСИМУМ(БазоваяНормаВремени),
	|	МАКСИМУМ(ЭтоУслуга)
	|ПО
	|	Номенклатура");
	
	ЗапросНоменклатур.УстановитьПараметр("Сотрудник"			  , Сотрудник);
	//ЗапросНоменклатур.УстановитьПараметр("МассивСтруктурныхЕдиниц", Сотрудник.МестаРаботы.ВыгрузитьКолонку("СтруктурнаяЕдиница"));
	ЗапросНоменклатур.УстановитьПараметр("МассивСтруктурныхЕдиниц", МестаРаботы.Выгрузить(,"СтруктурнаяЕдиница"));
	
	ВыборкаНоменклатур = ЗапросНоменклатур.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЭтаФорма._ПодборНоменклатурИсточникЭлементов.Очистить();
	
	НомераСтруктурныхЕдиниц = Новый Соответствие;
	Для Каждого СтрокаТЧ из МестаРаботы Цикл
		НомераСтруктурныхЕдиниц.Вставить(СтрокаТЧ.СтруктурнаяЕдиница, СтрокаТЧ.НомерСтроки);
	КонецЦикла;
	
	Пока ВыборкаНоменклатур.Следующий() Цикл
		
		СтрокаТЧ = ЭтаФорма._ПодборНоменклатурИсточникЭлементов.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаНоменклатур);
		
		ВыборкаЗначений = ВыборкаНоменклатур.Выбрать(ОбходРезультатаЗапроса.Прямой); 
		Пока ВыборкаЗначений.Следующий() Цикл 
			
			Если ЗначениеЗаполнено(ВыборкаЗначений.СтруктурнаяЕдиница) Тогда
				
				СтрокаТЧ["СтруктурнаяЕдиница" + НомераСтруктурныхЕдиниц[ВыборкаЗначений.СтруктурнаяЕдиница]] = Истина;
				
				Если ТипЗнч(ВыборкаЗначений.НормаВремениСотрудника) = Тип("Число") Тогда
					
					СтрокаТЧ.НормаВремени = ВыборкаЗначений.НормаВремениСотрудника;
					Если Не СтрокаТЧ.БазоваяНормаВремени = СтрокаТЧ.НормаВремени Тогда
						СтрокаТЧ.НормаВремениСотрудника = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура, выполянет создание дерева услуг.
//
Процедура СоздатьДеревоУслуг()
	
	РезультатЗапроса = ПолучитьМестаРаботы();
	НомерСтр = 1;
	Для Каждого стр из РезультатЗапроса Цикл
		НоваяСтр = МестаРаботы.Добавить();
		НоваяСтр.НомерСтроки = НомерСтр;
		НоваяСтр.СтруктурнаяЕдиница = стр.СтруктурнаяЕдиница;		
		НомерСтр = НомерСтр + 1;
	КонецЦикла;
	
	
	ИмяЭлементаДляРазмещения = "ГруппаДеревоНоменклатуры";
	масРеквизитов = Новый Массив;		
	
	ИмяДерева = "_ПодборНоменклатур";
	
	МассивДопустимыхТипов = Новый Массив;
	МассивДопустимыхТипов.Добавить(Тип("СправочникСсылка.Номенклатура"));
	МассивДопустимыхТипов.Добавить(Тип("Строка"));
	
	масРеквизитов.Добавить(Новый РеквизитФормы(ИмяДерева		       , Новый ОписаниеТипов("ДеревоЗначений"), , "Подбор номенклатур", Ложь));	
	масРеквизитов.Добавить(Новый РеквизитФормы("Номенклатура"	       , Новый ОписаниеТипов(МассивДопустимыхТипов), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("ЭтоГруппа"		       , Новый ОписаниеТипов("Булево"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("ЭтоУслуга"		       , Новый ОписаниеТипов("Булево"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("ИндКартинки"	       , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("НормаВремени"	       , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));	
	масРеквизитов.Добавить(Новый РеквизитФормы("БазоваяНормаВремени"   , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));	
	масРеквизитов.Добавить(Новый РеквизитФормы("НормаВремениСотрудника", Новый ОписаниеТипов("Булево"), ИмяДерева));
	
	//Для Каждого СтрокаТЧ из Сотрудник.МестаРаботы Цикл
	//	масРеквизитов.Добавить(Новый РеквизитФормы("СтруктурнаяЕдиница" + СтрокаТЧ.НомерСтроки,  Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(1,0)), ИмяДерева));
	//КонецЦикла;
	
	Для Каждого СтрокаТЧ из МестаРаботы Цикл
		масРеквизитов.Добавить(Новый РеквизитФормы("СтруктурнаяЕдиница" + СтрокаТЧ.НомерСтроки,  Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(1,0)), ИмяДерева));
	КонецЦикла;

	
	масРеквизитов.Добавить(Новый РеквизитФормы("_ПодборНоменклатурИсточникГрупп", Новый ОписаниеТипов("ДеревоЗначений"), , "Услгуи подбор список", Ложь));	
	масРеквизитов.Добавить(Новый РеквизитФормы("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"), "_ПодборНоменклатурИсточникГрупп"));
	
	ИмяДерева = "_ПодборНоменклатурИсточникЭлементов";
	масРеквизитов.Добавить(Новый РеквизитФормы(ИмяДерева		       , Новый ОписаниеТипов("ТаблицаЗначений"), , "Услгуи подбор список", Ложь));	
	масРеквизитов.Добавить(Новый РеквизитФормы("Номенклатура"	       , Новый ОписаниеТипов("СправочникСсылка.Номенклатура"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("ЭтоГруппа"		       , Новый ОписаниеТипов("Булево"), ИмяДерева));	
	масРеквизитов.Добавить(Новый РеквизитФормы("Родитель"		       , Новый ОписаниеТипов("СправочникСсылка.Номенклатура"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("ИндКартинки"	       , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("Артикул"		       , Новый ОписаниеТипов("Строка"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("Наименование"	       , Новый ОписаниеТипов("Строка"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("НормаВремени"	       , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("БазоваяНормаВремени"   , Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(10,0)), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("ЭтоУслуга"		       , Новый ОписаниеТипов("Булево"), ИмяДерева));
	масРеквизитов.Добавить(Новый РеквизитФормы("НормаВремениСотрудника", Новый ОписаниеТипов("Булево"), ИмяДерева));
	
	Для Каждого СтрокаТЧ из МестаРаботы Цикл
		масРеквизитов.Добавить(Новый РеквизитФормы("СтруктурнаяЕдиница" + СтрокаТЧ.НомерСтроки,  Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(1,0)), ИмяДерева));
	КонецЦикла;
	
	ИзменитьРеквизиты(масРеквизитов);	
	
	ЭлементДерево = Элементы.Добавить("_ПодборНоменклатур", Тип("ТаблицаФормы"), Элементы[ИмяЭлементаДляРазмещения]);
	ЭлементДерево.ПутьКДанным 				 = "_ПодборНоменклатур";
	ЭлементДерево.Отображение 				 = ОтображениеТаблицы.Дерево;
	ЭлементДерево.КартинкаСтрок 			 = БиблиотекаКартинок.ТерминалПодбор_Новый; //БиблиотекаКартинок.ПиктограммыЭлементов;
	ЭлементДерево.ПутьКДаннымКартинкиСтроки  = "_ПодборНоменклатур.ИндКартинки";
	//ЭлементДерево.КонтекстноеМеню.Видимость  = Ложь;
	ЭлементДерево.ПоложениеКоманднойПанели   = ПоложениеКоманднойПанелиЭлементаФормы.Нет;	
	ЭлементДерево.АвтоМаксимальнаяШирина 	 = Ложь;
	ЭлементДерево.РастягиватьПоГоризонтали	 = Истина; 
	ЭлементДерево.Высота                     = 16;
	//ЭлементДерево.МаксимальнаяШирина 	 	 = 120;
	ЭлементДерево.НачальноеОтображениеДерева = НачальноеОтображениеДерева.РаскрыватьВсеУровни;
	ЭлементДерево.УстановитьДействие("ПередНачаломДобавления", "Подключаемый_ПодборСотрудниковПередНачаломДобавления");
	ЭлементДерево.УстановитьДействие("ПередУдалением", "Подключаемый_ПодборСотрудниковПередУдалением");
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Номенклатура", Тип("ПолеФормы"), ЭлементДерево);	
	НовыйЭлемент.Вид 		 			 	 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоМаксимальнаяШирина 	 = Ложь;
	НовыйЭлемент.МаксимальнаяШирина 		 = 60;
	НовыйЭлемент.ТолькоПросмотр 		 	 = Истина;
	НовыйЭлемент.ЦветФонаЗаголовка	 		 = Новый Цвет(255, 255, 255);
	НовыйЭлемент.ПутьКДанным				 = "_ПодборНоменклатур.Номенклатура";
	
	НовыйЭлемент = Элементы.Добавить("НормаВремени", Тип("ПолеФормы"), ЭлементДерево);
	НовыйЭлемент.Вид		 				 = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным				 = "_ПодборНоменклатур.НормаВремени";
	НовыйЭлемент.Ширина 					 = 12;
	НовыйЭлемент.АвтоМаксимальнаяШирина 	 = Ложь;
	НовыйЭлемент.МаксимальнаяШирина 		 = 12;
	НовыйЭлемент.РастягиватьПоГоризонтали	 = Ложь;	
	НовыйЭлемент.Заголовок					 = "Норма времени";
	НовыйЭлемент.ЦветФонаЗаголовка	 		 = Новый Цвет(255, 255, 255);
	НовыйЭлемент.Доступность				 = ДоступноИзменениеУслугСотрудника;
	НовыйЭлемент.ГоризонтальноеПоложение	 = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_НормаВремениПриИзменении");
		
	Для Каждого СтрокаТЧ из МестаРаботы Цикл
		НовыйЭлемент = Элементы.Добавить("СтруктурнаяЕдиница"+СтрокаТЧ.НомерСтроки, Тип("ПолеФормы"), ЭлементДерево);
		НовыйЭлемент.Вид					 = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПутьКДанным			 = "_ПодборНоменклатур.СтруктурнаяЕдиница"+СтрокаТЧ.НомерСтроки;
		НовыйЭлемент.Заголовок				 = СтрокаТЧ.СтруктурнаяЕдиница.Наименование;		
		НовыйЭлемент.ТриСостояния			 = Истина;
		НовыйЭлемент.ЦветФонаЗаголовка	 	 = Новый Цвет(255, 255, 255);
		НовыйЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		НовыйЭлемент.Доступность			 = ДоступноИзменениеУслугСотрудника;
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПодборНоменклатураПриИзменении");
	КонецЦикла;	
	
	ЗаполнитьДеревоПодбораНоменклатур();
	
	ЗаполнитьСписокПодбораРекурсивноСервер(
	ЭтаФорма._ПодборНоменклатурИсточникГрупп.ПолучитьЭлементы(), 
	ЭтаФорма._ПодборНоменклатурИсточникЭлементов, 
	ЭтаФорма._ПодборНоменклатур, ЭтаФорма);		
	
	УстановитьНачальныеФлагиНаГруппы();
	
	Элементы.ГруппаФильтр.Доступность = ДоступноИзменениеУслугСотрудника;
	ЭтаФорма.ТолькоПросмотр			  = НЕ ДоступноИзменениеУслугСотрудника;
	
КонецПроцедуры

&НаКлиенте
// Выполняется после заполнения дерева подобра. Разворачивается дерево, установка тек. элемента
//
Процедура ПослеЗаполненияСпискаПодбораНоменклатур()
	
	Если ПодборОтобразитьДеревом И ПодборРазвернутьДерево Тогда		
		ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы._ПодборНоменклатур, ЭтаФорма._ПодборНоменклатур);
	КонецЕсли;
	
	ИдТекЭлемент = ПолучитьИдентификаторПервойНоменклатурыВспискеПодбора(ЭтаФорма._ПодборНоменклатур);
	
	Если ИдТекЭлемент <> Неопределено Тогда
		Элементы._ПодборНоменклатур.ТекущаяСтрока = ИдТекЭлемент;
	КонецЕсли;	
	
	Для Каждого ПунктКонтекстногоМеню Из Элементы._ПодборНоменклатур.КонтекстноеМеню.ПодчиненныеЭлементы Цикл
		ПунктКонтекстногоМеню.Видимость=Ложь;
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
// Функция, возвращает таблицу мест работы
//
Функция ПолучитьМестаРаботы()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НастройкиСотрудников.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.Сотрудник В(&Сотрудник)");
	
	Если Сотрудник.ЭтоГруппа = Истина Тогда
		// Если выбрана группа, получаем сотрудников которые в нее входят.
		Запрос.УстановитьПараметр("Сотрудник", ПолучитьСотрудниковГруппы(Сотрудник));
	Иначе
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции

&НаСервереБезКонтекста
// Процедура, получает сотрудников входящих в группу.
//
Функция ПолучитьСотрудниковГруппы(Родитель, ДобавитьРодителяВСписок = Ложь)
	
	Сотрудники = Новый Массив;
	
	Если Родитель.ЭтоГруппа = Истина Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Родитель = &Родитель");
		Запрос.УстановитьПараметр("Родитель", Родитель);
		
		Сотрудники = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Если ДобавитьРодителяВСписок = Истина Тогда
			Сотрудники.Добавить(Родитель);
		КонецЕсли;
		
		Возврат Сотрудники;
		
	Иначе
		
		Сотрудники.Добавить(Родитель);
		Возврат Сотрудники;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
// Процедура, выполняет установку условного оформления.
//
Процедура УстановитьУсловноеОформление()
	
	ЭлементУФ = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	
	ГруппаОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;	
	
	Для Каждого МестоРаботы из МестаРаботы Цикл	
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("_ПодборНоменклатур.СтруктурнаяЕдиница" + МестоРаботы.НомерСтроки); // имя поля	
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; // либо задаем свой
		ЭлементОтбора.ПравоеЗначение = 0;                                              
		ЭлементОтбора.Использование = Истина;
	КонецЦикла;
	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Видимость"), Ложь);
	
	ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Номенклатура");
	ПолеОформления.Использование = Истина;  
	ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НормаВремени");
	ПолеОформления.Использование = Истина;
	
	Для Каждого СтрокаТЧ из МестаРаботы Цикл
		ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();	
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("СтруктурнаяЕдиница" + СтрокаТЧ.НомерСтроки);
		ПолеОформления.Использование = Истина;		
	КонецЦикла;
	
	ЭлементУФ = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("_ПодборНоменклатур.ЭтоУслуга"); // имя поля	
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; // либо задаем свой
	ЭлементОтбора.ПравоеЗначение = Ложь;                                              
	ЭлементОтбора.Использование = Истина;
	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Доступность"), Ложь);
	
	ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НормаВремени");
	ПолеОформления.Использование = Истина; 
	
	ЭлементУФ = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("_ПодборНоменклатур.ЭтоГруппа"); // имя поля	
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; // либо задаем свой
	ЭлементОтбора.ПравоеЗначение = Истина;                                              
	ЭлементОтбора.Использование = Истина;
	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЦветФона"), Новый Цвет(245,245,245));
	
	ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("_ПодборНоменклатур");
	ПолеОформления.Использование = Истина; 
	
	ЭлементУФ = ЭтаФорма.УсловноеОформление.Элементы.Добавить();
	
	ЭлементОтбора = ЭлементУФ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("_ПодборНоменклатур.НормаВремениСотрудника"); // имя поля	
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; // либо задаем свой
	ЭлементОтбора.ПравоеЗначение = Истина;                                              
	ЭлементОтбора.Использование = Истина;
	
	ЭлементУФ.Оформление.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ЦветТекста"), WebЦвета.Зеленый);
	
	ПолеОформления = ЭлементУФ.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("НормаВремени");
	ПолеОформления.Использование = Истина; 
	
КонецПроцедуры

&НаСервере
// Процедура, заполняет источник групп
//
Процедура ЗаполнитьИсточникГрупп(ВыборкаГрупп,УровеньЗаполнения)

	Для Каждого УровеньОбхода ИЗ ВыборкаГрупп.Строки Цикл
		
		НоваяСтрока = УровеньЗаполнения.Добавить();
		ЗаполнитьИсточникГрупп(УровеньОбхода,НоваяСтрока.ПолучитьЭлементы());
		НоваяСтрока.Номенклатура = УровеньОбхода.Ссылка; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура рекурсивного заолнения дерева подбора номенклатур
//
Процедура ЗаполнитьСписокПодбораРекурсивноСервер(ИсточникГрупп,ИсточникНоменклатуры,ЭлементЗаполнения, Форма)
	
	ФильтрДанные = НРег(ПодборФильтр);	
	Если ПодборОтобразитьДеревом Тогда 
		
		Для Каждого УровеньЗаполнения ИЗ ИсточникГрупп Цикл	
			Если ЗначениеЗаполнено(УровеньЗаполнения.Номенклатура) Тогда 
				НоваяСтрокаГруппы              = ЭлементЗаполнения.ПолучитьЭлементы().Добавить();
				НоваяСтрокаГруппы.Номенклатура = УровеньЗаполнения.Номенклатура;		
				НоваяСтрокаГруппы.ЭтоГруппа    = Истина;				
			Иначе 
				НоваяСтрокаГруппы = Форма._ПодборНоменклатур; 				
			КонецЕсли;
			
			ЗаполнитьСписокПодбораРекурсивноСервер(УровеньЗаполнения.ПолучитьЭлементы(),ИсточникНоменклатуры, НоваяСтрокаГруппы, Форма);						
			НоменклатураПоРодителю = Форма._ПодборНоменклатурИсточникЭлементов.НайтиСтроки(Новый Структура("Родитель", УровеньЗаполнения.Номенклатура));	
			
			// Заполняем номенклатуры
			Для Каждого СтрокаН ИЗ НоменклатураПоРодителю Цикл
				Если ЗначениеЗаполнено(ПодборФильтр) Тогда
					Если ПодборПереключательФильтра = 0 Тогда 
						Если НЕ НРег(СтрокаН.Артикул) = ФильтрДанные И СтрЧислоВхождений(НРег(СтрокаН.Наименование),ФильтрДанные) = 0  Тогда
							Продолжить;
						КонецЕсли;
					ИначеЕсли ПодборПереключательФильтра = 1 Тогда 
						Если НЕ НРег(СтрокаН.Артикул) = ФильтрДанные Тогда
							Продолжить;
						КонецЕсли;
					Иначе 
						Если СтрЧислоВхождений(НРег(СтрокаН.Наименование),ФильтрДанные) = 0 Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;			
				КонецЕсли;
				НоваяСтрока = НоваяСтрокаГруппы.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаН);
			КонецЦикла;	
			
			// Удаляем узел группы если он не содержит элементы
			Если НоваяСтрокаГруппы.ПолучитьЭлементы().Количество() = 0 и Не ТипЗнч(НоваяСтрокаГруппы) = Тип("ДанныеФормыДерево") Тогда
				ЭлементЗаполнения.ПолучитьЭлементы().Удалить(НоваяСтрокаГруппы);
			КонецЕсли;	
			
		КонецЦикла;	
	Иначе
		
		ЭлементыЗаполнения = ЭлементЗаполнения.ПолучитьЭлементы();
		
		Для Каждого УровеньЗаполнения ИЗ ИсточникНоменклатуры Цикл
			Если ЗначениеЗаполнено(ПодборФильтр) Тогда
				Если ПодборПереключательФильтра = 0 Тогда 
					
					Если НЕ НРег(УровеньЗаполнения.Артикул) = ФильтрДанные И СтрЧислоВхождений(НРег(УровеньЗаполнения.Наименование),ФильтрДанные) = 0  Тогда
						Продолжить;
					КонецЕсли;
					
				ИначеЕсли ПодборПереключательФильтра = 1 Тогда 
					Если НЕ НРег(УровеньЗаполнения.Артикул) = ФильтрДанные Тогда
						Продолжить;
					КонецЕсли;
				Иначе 
					
					Если СтрЧислоВхождений(НРег(УровеньЗаполнения.Наименование),ФильтрДанные) = 0 Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;			
			КонецЕсли;
			
			НоваяСтрока = ЭлементыЗаполнения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,УровеньЗаполнения);
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура рекурсивного заолнения дерева подбора номенклатур
//
Процедура ЗаполнитьСписокПодбораРекурсивно(ИсточникГрупп ,ИсточникНоменклатуры, ЭлементЗаполнения, Форма)
	
	ФильтрДанные = НРег(ПодборФильтр);
	
	Если ПодборОтобразитьДеревом Тогда
		Для Каждого УровеньЗаполнения ИЗ ИсточникГрупп Цикл
			Если ЗначениеЗаполнено(УровеньЗаполнения.Номенклатура) Тогда
				НоваяСтрокаГруппы              = ЭлементЗаполнения.ПолучитьЭлементы().Добавить();
				НоваяСтрокаГруппы.Номенклатура = УровеньЗаполнения.Номенклатура;		
				НоваяСтрокаГруппы.ЭтоГруппа    = Истина;
			Иначе
				НоваяСтрокаГруппы = ЭтаФорма._ПодборНоменклатур;
			КонецЕсли;
			
			ЗаполнитьСписокПодбораРекурсивно(УровеньЗаполнения.ПолучитьЭлементы(),ИсточникНоменклатуры,НоваяСтрокаГруппы, Форма);			
			НоменклатураПоРодителю = ЭтаФорма._ПодборНоменклатурИсточникЭлементов.НайтиСтроки(Новый Структура("Родитель", УровеньЗаполнения.Номенклатура));
			
			// Заполняем номенклатуры
			Для Каждого СтрокаН ИЗ НоменклатураПоРодителю Цикл
				Если ЗначениеЗаполнено(ПодборФильтр) Тогда
					Если ПодборПереключательФильтра = 0 Тогда 
						Если НЕ НРег(СтрокаН.Артикул) = ФильтрДанные И СтрЧислоВхождений(НРег(СтрокаН.Наименование),ФильтрДанные) = 0  Тогда
							Продолжить;
						КонецЕсли;
					ИначеЕсли ПодборПереключательФильтра = 1 Тогда 
						Если НЕ НРег(СтрокаН.Артикул) = ФильтрДанные Тогда
							Продолжить;
						КонецЕсли;
					Иначе 
						Если СтрЧислоВхождений(НРег(СтрокаН.Наименование),ФильтрДанные) = 0  Тогда
							Продолжить;
						КонецЕсли;
					КонецЕсли;			
				КонецЕсли;
				НоваяСтрока = НоваяСтрокаГруппы.ПолучитьЭлементы().Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаН);
			КонецЦикла;	
			
			// Удаляем узел группы если он не содержит элементы
			Если НоваяСтрокаГруппы.ПолучитьЭлементы().Количество() = 0 и Не ТипЗнч(НоваяСтрокаГруппы) = Тип("ДанныеФормыДерево") Тогда
				ЭлементЗаполнения.ПолучитьЭлементы().Удалить(НоваяСтрокаГруппы);
			КонецЕсли;				
		КонецЦикла;	
		
	Иначе
		
		ЭлементыЗаполнения = ЭлементЗаполнения.ПолучитьЭлементы();
		Для Каждого УровеньЗаполнения ИЗ ИсточникНоменклатуры Цикл
			Если ЗначениеЗаполнено(ПодборФильтр) Тогда
				Если ПодборПереключательФильтра = 0 Тогда 
					Если НЕ НРег(УровеньЗаполнения.Артикул) = ФильтрДанные И СтрЧислоВхождений(НРег(УровеньЗаполнения.Наименование),ФильтрДанные) = 0  Тогда
						Продолжить;
					КонецЕсли;
				ИначеЕсли ПодборПереключательФильтра = 1 Тогда 
					Если НЕ НРег(УровеньЗаполнения.Артикул) = ФильтрДанные Тогда
						Продолжить;
					КонецЕсли;
				Иначе 
					Если СтрЧислоВхождений(НРег(УровеньЗаполнения.Наименование),ФильтрДанные) = 0 Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;			
			КонецЕсли;
			НоваяСтрока = ЭлементыЗаполнения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,УровеньЗаполнения);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, устанавливает флаги на группы при первоночальном построение дерева.
//
Процедура УстановитьНачальныеФлагиНаГруппы(Сотрудник = Неопределено)
	
	ТаблицаМестаРаботы = ?(Сотрудник <> Неопределено, МестаРаботы, ЭтотОбъект.МестаРаботы);
	
	// Проставялем флаги на группах дерева.
	ДанныеДерева = ЭтаФорма._ПодборНоменклатур.ПолучитьЭлементы();
	Для Каждого СтрокаТЧ Из ДанныеДерева Цикл
		Для Каждого МестоРаботы Из ТаблицаМестаРаботы Цикл
			Если СтрокаТЧ.ЭтоГруппа Тогда
				ОбработкаТабличныхЧастейКлиент.УстановитьНачальныеФлагиНаГруппы(СтрокаТЧ, "СтруктурнаяЕдиница" + МестоРаботы.НомерСтроки);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет перезаполнение дерева на клиенте
//
Процедура ПерезаполнитьДеревоПодбораНоменклатур() 
	
	ЭтаФорма._ПодборНоменклатур.ПолучитьЭлементы().Очистить();
	ЗаполнитьСписокПодбораРекурсивно(ЭтаФорма._ПодборНоменклатурИсточникГрупп.ПолучитьЭлементы(), ЭтаФорма._ПодборНоменклатурИсточникЭлементов, ЭтаФорма._ПодборНоменклатур, ЭтаФорма);
	ПослеЗаполненияСпискаподбораноменклатур();
	
КонецПроцедуры

&НаКлиенте
// Функция вернет идентификатор строки элемента или группы
//
Функция ПолучитьИдентификаторПервойНоменклатурыВспискеПодбора(ТаблицаПодбора, ВернутьГруппу = Ложь)
	
	ВерхнийУровень = ТаблицаПодбора.ПолучитьЭлементы();
	
	Для Каждого ЭлементУровня ИЗ ВерхнийУровень Цикл 
		
		Для НомерСЕ = 1 по МестаРаботы.Количество() Цикл 
			
			Если ЭлементУровня.ЭтоГруппа и ЭлементУровня["СтруктурнаяЕдиница"+НомерСЕ] Тогда
				
				Если ВернутьГруппу Тогда
					Возврат ЭлементУровня.ПолучитьИдентификатор();
				Иначе
					Рез = ПолучитьИдентификаторПервойНоменклатурыВспискеПодбора(ЭлементУровня); 
					Если Рез <> Неопределено Тогда
						Возврат Рез;
					КонецЕсли;				
				КонецЕсли;
				
			ИначеЕсли ЭлементУровня["СтруктурнаяЕдиница"+НомерСЕ] Тогда
				
				Возврат ЭлементУровня.ПолучитьИдентификатор();
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Неопределено; 
	
КонецФункции

&НаКлиенте
// Процедура, выполняет установку флагов на элменеты.
//
Процедура УстановитьФлагиНаЭлементы(ТекущиеДанные, ИмяКолонки)
	
	Флаг 		 = ТекущиеДанные[ИмяКолонки];
	ДанныеДерева = ТекущиеДанные.ПолучитьЭлементы();
	
	Для Каждого СтрокаДерева из ДанныеДерева Цикл
		
		Если Фильтр = 1 Тогда
			
			Видимость = Ложь;
			
			Для НомерСЕ = 1 по МестаРаботы.Количество() Цикл
				Если СтрокаДерева["СтруктурнаяЕдиница"+НомерСЕ] Тогда
					Видимость = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			Видимость = Истина;
		КонецЕсли;
		
		Если Видимость Тогда
			СтрокаДерева[ИмяКолонки] = Флаг;
		КонецЕсли;
		
		Если СтрокаДерева.ЭтоГруппа Тогда
			УстановитьФлагиНаЭлементы(СтрокаДерева, ИмяКолонки);
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
// Процедура, устанавливает флаги на группы.
//
Процедура УстановитьФлагиНаГруппы(ТекущиеДанные, ИмяКолонки, ЭтоРодитель = Ложь)
	
	Если ЭтоРодитель Тогда
		Родитель = ТекущиеДанные;
	Иначе
		Родитель = ТекущиеДанные.ПолучитьРодителя();
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеДерева = Родитель.ПолучитьЭлементы();
	
	КоличествоВыбранных = 0;
	Для Каждого СтрокаДерева из ДанныеДерева Цикл
		
		Если СтрокаДерева[ИмяКолонки] = 1 Тогда
			КоличествоВыбранных = КоличествоВыбранных + 1;
		ИначеЕсли СтрокаДерева[ИмяКолонки] = 2 Тогда
			КоличествоВыбранных = -1;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если КоличествоВыбранных = ДанныеДерева.Количество() Тогда
		Родитель[ИмяКолонки] = 1;
	ИначеЕсли КоличествоВыбранных = 0 Тогда
		Родитель[ИмяКолонки] = 0;
	Иначе
		Родитель[ИмяКолонки] = 2;
	КонецЕсли;		
	
	УстановитьФлагиНаГруппы(Родитель, ИмяКолонки);
	
КонецПроцедуры

&НаСервере
// Процедура, выполянет сохранение значений в регистр сведений.
//
Процедура СохранитьЗначения(Знач ТаблицаНоменклатуры, Сотрудник)
	
	Таблица = ДанныеФормыВЗначение(ТаблицаНоменклатуры, Тип("ТаблицаЗначений"));
	
	Если Сотрудник.ЭтоГруппа = Истина Тогда
		
		Сотрудники = ПолучитьСотрудниковГруппы(Сотрудник, Истина);
		Для Каждого Работник из Сотрудники Цикл
			
			// Отбираем номенклатуру относящуюся к определенному сотруднику.
			НоменклатураСотрудника = ПолучитьТаблицуНоменклатурыСотрудника(Таблица, Работник);
			
			НаборЗаписей = РегистрыСведений.УслугиСотрудника.СоздатьНаборЗаписей();
			НаборЗаписей.Загрузить(НоменклатураСотрудника);
			НаборЗаписей.Отбор.Сотрудник.Использование = Истина;
			НаборЗаписей.Отбор.Сотрудник.Значение = Работник;
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.УслугиСотрудника.СоздатьНаборЗаписей();			
		НаборЗаписей.Загрузить(Таблица);
		НаборЗаписей.Отбор.Сотрудник.Использование = Истина;
		НаборЗаписей.Отбор.Сотрудник.Значение = Сотрудник;
		НаборЗаписей.Записать(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет заполнение таблицы номенклатруры.
//
Процедура ЗаполнитьТаблицуНоменклатуры(Родитель) 
	
	ДанныеДерева = Родитель.ПолучитьЭлементы();	
	
	Для Каждого СтрокаДерева из ДанныеДерева Цикл		
		Если СтрокаДерева.ЭтоГруппа Тогда
			ЗаполнитьТаблицуНоменклатуры(СтрокаДерева);
		Иначе
			ЗаполнитьСтрокуТаблицыНоменклатуры(СтрокаДерева);	
		КонецЕсли;
	КонецЦикла;   
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет заполнение строки таблицы.
//
Процедура ЗаполнитьСтрокуТаблицыНоменклатуры(СтрокаДерева)
	
	Для Каждого МестоРаботы из МестаРаботы Цикл
		
		Если СтрокаДерева["СтруктурнаяЕдиница" + МестоРаботы.НомерСтроки] Тогда
			НоваяСтрока                    = ТаблицаНоменклатуры.Добавить();
			НоваяСтрока.Сотрудник          = Сотрудник;
			НоваяСтрока.СтруктурнаяЕдиница = МестоРаботы.СтруктурнаяЕдиница;
			НоваяСтрока.Номенклатура       = СтрокаДерева.Номенклатура;
			НоваяСтрока.НормаВремени       = СтрокаДерева.НормаВремени;
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры

&НаКлиенте
// Процедура, выбрать все строки.
//
Процедура ВыбратьСтроки(Команда)
	
	Установить = 1;
	 
	СтруктурнаяЕдиница = Элементы.ГруппаДеревоНоменклатуры.ПодчиненныеЭлементы._ПодборНоменклатур.ТекущийЭлемент.Имя;
	
	Если Лев(СтруктурнаяЕдиница, 18) = "СтруктурнаяЕдиница" Тогда  
		ОтметитьУслугиСотрудника(Установить, СтруктурнаяЕдиница);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, исключить все строки.
//
Процедура ИсключитьСтроки(Команда)
	
	Установить = 0; 
	СтруктурнаяЕдиница = Элементы.ГруппаДеревоНоменклатуры.ПодчиненныеЭлементы._ПодборНоменклатур.ТекущийЭлемент.Имя;
	
	Если Лев(СтруктурнаяЕдиница, 18) = "СтруктурнаяЕдиница" Тогда  
		ОтметитьУслугиСотрудника(Установить, СтруктурнаяЕдиница);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, отмечает услуги сотрудников.
//
Процедура ОтметитьУслугиСотрудника(Установить, СтруктурнаяЕдиница)
	
	ТаблицаМестаРаботы = ?(Сотрудник <> Неопределено, МестаРаботы, ЭтотОбъект.МестаРаботы);
	Для Каждого МестоРаботы Из ТаблицаМестаРаботы Цикл
		МестоРаботыСотрудника = "СтруктурнаяЕдиница" + МестоРаботы.НомерСтроки;		
	
		ДанныеДерева = ЭтаФорма._ПодборНоменклатур.ПолучитьЭлементы();
		Для Каждого СтрокаТЧ Из ДанныеДерева Цикл
			ТекущиеДанные = СтрокаТЧ;
			ИмяКолонки 	  = МестоРаботыСотрудника;
			ТекущиеДанные[СтруктурнаяЕдиница] = Установить;
			УстановитьФлагиНаЭлементы(ТекущиеДанные, ИмяКолонки);
			УстановитьФлагиНаГруппы(ТекущиеДанные, ИмяКолонки, Истина);
		КонецЦикла;
		
		ТаблицаНоменклатуры.Очистить();
		ДанныеДерева = ЭтаФорма._ПодборНоменклатур.ПолучитьЭлементы();
		Для Каждого СтрокаТЧ из ДанныеДерева Цикл
			
			Если СтрокаТЧ.ЭтоГруппа Тогда
				ЗаполнитьТаблицуНоменклатуры(СтрокаТЧ);
			Иначе
				ЗаполнитьСтрокуТаблицыНоменклатуры(СтрокаТЧ);
			КонецЕсли;
			
		КонецЦикла;
		
		СохранитьЗначения(ТаблицаНоменклатуры, Сотрудник);
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
// Процедура, выполянет копирование настроек сотрудника.
//
Процедура СкопироватьНастройкиСотрудника(Источник)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСтруктурныхЕдиниц", МестаРаботы.Выгрузить(,"СтруктурнаяЕдиница"));
	Запрос.УстановитьПараметр("Источник" , Источник);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Сотрудник КАК Сотрудник,
	|	УслугиСотрудника.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	УслугиСотрудника.Номенклатура КАК Номенклатура,
	|	УслугиСотрудника.НормаВремени КАК НормаВремени
	|ИЗ
	|	РегистрСведений.УслугиСотрудника КАК УслугиСотрудника
	|ГДЕ
	|	УслугиСотрудника.Сотрудник = &Источник
	|	И УслугиСотрудника.СтруктурнаяЕдиница В(&МассивСтруктурныхЕдиниц)";
	
	Результат = Запрос.Выполнить().Выгрузить();
	НаборЗаписей = РегистрыСведений.УслугиСотрудника.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Результат);
	НаборЗаписей.Отбор.Сотрудник.Использование = Истина;
	НаборЗаписей.Отбор.Сотрудник.Значение = Сотрудник;
	НаборЗаписей.Записать(Истина);
	
	ЭтаФорма._ПодборНоменклатур.ПолучитьЭлементы().Очистить();
	
	ЗаполнитьДеревоПодбораНоменклатур();
	
	ЗаполнитьСписокПодбораРекурсивноСервер(
	ЭтаФорма._ПодборНоменклатурИсточникГрупп.ПолучитьЭлементы(), 
	ЭтаФорма._ПодборНоменклатурИсточникЭлементов, 
	ЭтаФорма._ПодборНоменклатур, ЭтаФорма);	
	
	УстановитьНачальныеФлагиНаГруппы(Сотрудник);
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает таблицу номенклатуры для определенного сотрудника.
//
Функция ПолучитьТаблицуНоменклатурыСотрудника(ТаблицаНоменклатуры, Сотрудник)
	
	// Создаем ТаблицуЗначений.
	НоменклатураСотрудника = Новый ТаблицаЗначений;
	НоменклатураСотрудника.Колонки.Добавить("Номенклатура");
	НоменклатураСотрудника.Колонки.Добавить("НормаВремени");
	НоменклатураСотрудника.Колонки.Добавить("СтруктурнаяЕдиница");
	НоменклатураСотрудника.Колонки.Добавить("Сотрудник");
	
	// Перебираем таблицу и фильтруем по сотруднику.
	Для каждого Строка из ТаблицаНоменклатуры Цикл
		Если Строка.Сотрудник = Сотрудник Тогда
			СтрокаТЗ = НоменклатураСотрудника.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЗ, Строка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НоменклатураСотрудника;
	
КонецФункции

#КонецОбласти
